{"1bzbmjt": "I cosplayed Yoimiya!", "1c07fdm": "Smiling cutie✨✨", "1c0c2r1": "What exactly do we know about Egeria the old hydro archon?", "1c01ntd": "Something happened to the Fatui... [Hi3 crossover]", "1c07czw": "HoYoFair 2024 Teaser", "1c07wih": "Who to pull for?", "1bzvv6w": "Happy birthday Charlotte!", "1bzbndw": "My (hellbkl) Kazuha cosplay", "1bzvebe": "How many of you wish this was true? 🥹💚🪽 ", "1bzbl5t": "You can fit 58 Teahouse Cushions in a small room", "1c0bt6q": "Arlecchino fanart", "1bzj00n": "Custom Lego - Height accurate lego (Venti, Raiden, Xiao, Zhongli)", "1bzwacs": "Mage Furina_design by me", "1c0bn88": "Assign a Pokemon", "1c0kcw8": "Thoughts?", "1c0c2ut": "They had redeemed themselves for fumbling the possible dog dog interaction", "1c0gnct": "Finishing the web event in 6 minutes", "1c00tjj": "what to do with weapons that are seemingly underpowered", "1c0jvgf": "My gf told me i look like a Lawachurl, should i break up with her?", "1c0b5lm": "What in the world am I supposed to do with this? Skimmed all the tutorials and still don't know what to do.", "1bzvsij": "2024 Birthday Calendar Illustration (CN): Charlotte", "1c0mzbw": "After 6 versions with Fontaine, I can finally complete my first commissions there...", "1bz2wmu": "Anemo Boys turned into cats while Aether suffers", "1c0qufp": "Thinking about give her some fan lore", "1bzzxwb": "Out of all of these pictures which one are you most likely to put as your wallpaper? #14", "1c06egl": "I got 2 nearly identical artifacts", "1bzvqfy": "Was Paimon always this loud?", "1c0ch3o": "Happy Birthday, Charlotte!", "1bzhhh3": "Why is it impossible to be normal about Scaramouche? ", "1c0jxno": "\"Sorry, it's me again...\"", "1bzikkb": "Yo straight up, cat event is disappointing.", "1bysi6p": "dumb comic i drew of faruzan, al haitham and cyno", "1c0cogu": "my eid accessory", "1c0g7t0": "The result", "1bywty4": "I made THE BELL out of EVA Foam", "1bzfp7e": "Wouldn't it be nice if we have this QOL?", "1bzf476": "Hu Tao keychain my wife made! ", "1bzp188": "What sword would be best f2p for Kazuha", "1bzyc6b": "Decided to download genshin on my new PC", "1c0ljc3": "Diona's Hangout bugged?", "1c0j9qg": "finally", "1bzunnx": "Made a sketch featuring Yoimiya and Ayaka", "1c0ibuy": "Kunoichi shinobu", "1c0iiut": "New Potential Idol Group Spotted! (@henxtie)", "1bzupo3": "Puzzle", "1c0fpzg": "Charlotte needs help on her birthday", "1c0mtx9": "Who do I use this for? and no, I don't have nahida nor kazuha", "1c0fddi": "why does the cat keep sneezing?", "1bzi9wr": "Out of all of these pictures which one are you most likely to put as your wallpaper? #13", "1c0etd8": "I'm just here to lift of my sadness. Don't mind me", "1bztz34": "So, even minor things Traveler does are canon", "1c0muck": "This really all I can use my Geo Sigils on?", "1c0qzzp": "Furina by me", "1bzfaww": "How to get this sacred seal?", "1c0l40m": "Can we all appreciate how Genshin handled a court trial so beautifully", "1bzt52j": "Mountain creature quest bug", "1bzissh": "Neuvillette after Focalors went poof :(", "1c0r3bd": "Hu Tao is obviously the GOAT, so I drawed her", "1c0eem1": "I didn't have the patience to play \"Hollow Knight\" event on Keyboard or Touchscreen, so I used a Controller instead ", "1c0q77b": "My Submissions for the Catified Teyvat Fanart Event!", "1c0pun9": "Happy bday Charlotte", "1c0h1ua": "Daily Questions Megathread (April 10, 2024)", "1bzsgsr": "Heads up, you can get welkins for just 50p if you have a samsung device", "1c04lsg": "My cat cuddling with Venti plush", "1c0nkz4": "Is Neuvillette the only character who glows for a long duration even when he is not charge attacking?", "1c0mki9": "Ganyu fanart", "1bzcn4h": "If I get 5 star on normal banner does that mean", "1bzflif": "The most terrifying story item to get", "1c0g6l3": "My Hollow Knight Colosseum of Fools PTSD is coming back", "1c0b60t": "Cutscenes don’t make you immortal, but the show MUST go on….", "1c04ahl": "How do I stop regretting my banner choices", "1bzjb60": "Would different kinds of resin be an improvement to the resin system?", "1bzu3cq": "Would you guys like it if HYV ever makes 5* versions for some of the current 4* characters, just like Star Rail?", "1c075m7": "How to defeat this😭", "1bzqvl0": "An interesting detail about Furina's eyelashes", "1bzzolx": "For the first time since playing day 1, I've successfully reached 36* on Spiral Abyss in version 4.5", "1c0cyj9": "Best and Easiest Recovery dish to farm for?", "1bzugvr": "Account", "1c04y9c": "Will there be 120hz? Iphone 15 pro max have it.", "1c0k6kp": "Tips on how to use Interactive map + Resonance Stone to find all Oculi without worrying about missing any of it.", "1c0oo7s": "Which team comp of my characters do you think works best with Alhaitham as the dps? I'll level characters if I have to, and if it matters, I've got Scara's signature and Amos bow", "1c0evao": "cards (not tcg)", "1c0ladr": "I made a tierlist based on who would join us for our adventures.", "1c0j9fx": "You have to pick 4 characters to protect you while the rest  hunt you down, who are you picking and why?", "1bzx258": "I'm thinking about her now. So... How do I take her out? Is my rizz enough?", "1c0gqul": "What about Genshin trailers", "1bzkdeb": "Finally got the Crit Rate and Crit Damage to be the exact same number", "1c0mqtm": "So I was wondering ", "1bztz66": "Nahida is almost maxed, who should I level next?", "1c0fdpe": "Treasure compass should also points to puzzles", "1c055zo": "Do you think the furball fortress will still exist after the event ends?", "1c0abjg": "Ayaka cosplayer during Eid-ul-fitr prayers this morning ", "1bznqbn": "You Finally Finished You're Adventure & Found You're Long-Lost Sibling, As You Prepare to Leave, You Say Goodbye to Paimon, You're Adventuring Partner and a Good Friend. But then It Strikes You. Will You Take Paimon along with You Or Leave with You're Sibling?", "1bz7cpr": "Which burst would hurt the most irl?", "1bzjjet": "Which character is more than likely to commit tax evasion?", "1bzf1bd": "Rosaria in the new event :)", "1c0do80": "Charlotte's Birthday Mail", "1bzpdvw": "Ganyu Illustration~", "1c0jnt6": "Happy Birthday Charlotte!! 📷📰🧀 (PS5 screenshots)", "1c0c20a": "Cyno yugioh reference?", "1c0kit8": "I'm surper happy with Klee!!", "1c0hti5": "Head empty, just Husbandos every day :)", "1c0491m": "Hoyo pls give me these skins", "1bzf6or": "Yae Miko Bunny suit 3D print made by a friend", "1bzwpzd": "There's no reason this webgame should be this challenging, but I am all for it!", "1bzi21k": "Facts", "1c0geik": "Do you equip weapons on characters that match their drip over being good for them?", "1c0no8y": "The last stage of Rolling Crossfire is actually quite fun", "1c030h9": "Build question for hutao", "1c0m41h": "This web event is exactly the kind of difficult content that genshin needs! Now they just have to add the same difficulty to fights in game", "1c0e378": "Happy birthday to Charlotte!! 🗞️🌟", "1bzbzjq": "Hero the Copy Cat", "1bzswbs": "TIL that in low WL/AR, enemies drop 1-star weapons too", "1c093te": "Eula: \"My eyes are up here!\" (Artist: 飛沫かもめ)", "1bz4vqt": "Feast", "1c0q2hz": "BIRTHDAY MONTH TWINS!! 🤩", "1c0jscq": "(75% OOT) I'm finished with Helldivers 2 and going back to gacha world", "1bzhp5t": "How i never noticed her?", "1c0njj2": "I was today years old when I found out that Jean has special \"interaction\" with cats", "1bzwwsp": "What's your most hated gameplay in Genshin Impact ? Mine is the brainstorming, and I can't think of anything more annoying", "1bzb94s": "This cannot be real lmao", "1c093pz": "Predicting future patches in Genshin Impact.", "1c0jkse": "Kokomi Chibi", "1c0je9h": "AR 58 cant floor 12 :(", "1c0p4bd": "2024 Birthday Calendar Illustration (CN): Xianyun", "1bzx8p2": "999 Achievements Complete 💯", "1bzlvfl": "do i try and 100% teyvat?", "1c07wvf": "How many C6R1 players are there", "1bzuwyv": "What's going on in my Mondstadt? Did Inazuma invade them? Why my Mondstadt theme music is Inazuma's?", "1bzfj0o": "What are best Genshin Impact slander names?", "1c0p52y": "This website has some of the worst team recommendations. I think everyone should stay away from it and just ask people on Reddit or Discord.", "1c0kyvf": "This team is satisfying... Anyways, any artifact recommendations for Charlotte?", "1c0km9o": "I cleared the Fan Game \"Lightning-Riding Swordsman\" in 5:26.77 from Start to defeating Ei.", "1byvw5n": "Genshin characters simplified, are people able to tell who they are just from a few lines of colours?", "1c0cel0": "Version 4.6 Special Program Preview", "1c01nbv": "Where am I supposed to pet on this cat?", "1bz120x": "so...I might have a crush", "1bz4jy3": "Animators Across the World Assembled to Draw Genshin Impact in 25 Styles - HoyoFair", "1bz96cn": "What's your biggest insecurity within Genshin?", "1bzffay": "Neuvillette is popular"}