{
    "1bysi6p": "dumb comic i drew of faruzan, al haitham and cyno",
    "1byt12k": "New NPC design or they are just graphically enhanced? Feels different.",
    "1byuqpz": "I was wondering where my last shrine key was (Ar 59 300k exp)",
    "1byvnle": "Finally got the perfect setup to running away from Collei's Boomerang",
    "1byvw5n": "Genshin characters simplified, are people able to tell who they are just from a few lines of colours?",
    "1bywty4": "I made THE BELL out of EVA Foam",
    "1bywx39": "My dad randomly gave me this art book",
    "1bz0srb": "To do what? 😳😳😳",
    "1bz120x": "so...I might have a crush",
    "1bz1rp9": "I am once again asking for the daily rotation of domains to be retired.",
    "1bz2wmu": "Anemo Boys turned into cats while Aether suffers",
    "1bz4jy3": "Animators Across the World Assembled to Draw Genshin Impact in 25 Styles - HoyoFair",
    "1bz4lne": "Congrats to Xiao for being one of the most encountered characters",
    "1bz4vqt": "Feast",
    "1bz7cpr": "Which burst would hurt the most irl?",
    "1bz96cn": "What's your biggest insecurity within Genshin?",
    "1bz9tgz": "If you could exchange one of your limited 5⭐ for another, who would it be? Just one constellation's worth",
    "1bzb94s": "This cannot be real lmao",
    "1bzbl5t": "You can fit 58 Teahouse Cushions in a small room",
    "1bzbmjt": "I cosplayed Yoimiya!",
    "1bzbndw": "My (hellbkl) Kazuha cosplay",
    "1bzbzjq": "Hero the Copy Cat",
    "1bzcn4h": "If I get 5 star on normal banner does that mean",
    "1bze931": "not a thought behind those eyes",
    "1bzf1bd": "Rosaria in the new event :)",
    "1bzf476": "Hu Tao keychain my wife made! ",
    "1bzf6or": "Yae Miko Bunny suit 3D print made by a friend",
    "1bzfaww": "How to get this sacred seal?",
    "1bzffay": "Neuvillette is popular",
    "1bzfj0o": "What are best Genshin Impact slander names?",
    "1bzflif": "The most terrifying story item to get",
    "1bzfp7e": "Wouldn't it be nice if we have this QOL?",
    "1bzhhh3": "Why is it impossible to be normal about Scaramouche? ",
    "1bzhp5t": "How i never noticed her?",
    "1bzi21k": "Facts",
    "1bzi9wr": "Out of all of these pictures which one are you most likely to put as your wallpaper? #13",
    "1bzikkb": "Yo straight up, cat event is disappointing.",
    "1bzissh": "Neuvillette after Focalors went poof :(",
    "1bzj00n": "Custom Lego - Height accurate lego (Venti, Raiden, Xiao, Zhongli)",
    "1bzjb60": "Would different kinds of resin be an improvement to the resin system?",
    "1bzjfvl": "How have your journey been?",
    "1bzjjet": "Which character is more than likely to commit tax evasion?",
    "1bzjzfm": "What has been your favorite event so far?",
    "1bzkdeb": "Finally got the Crit Rate and Crit Damage to be the exact same number",
    "1bzkgdu": "Got this Nahida pillow plush. And now she can make new friends",
    "1bzkge6": "Almost 4 years and this screen on pc still doesn't detect controller",
    "1bzko38": "(Request) Is there anyone skilled enough to get the gif of the kittens from the event?",
    "1bzlp3e": "Neuvilette pics I took to celebrate his arrival",
    "1bzlvfl": "do i try and 100% teyvat?",
    "1bzmgnr": "\"Die!\"",
    "1bzngmz": "Daily Questions Megathread (April 09, 2024)",
    "1bznhq2": "my parents surprised me by gift <3 I love you mom and dad",
    "1bznqbn": "You Finally Finished You're Adventure & Found You're Long-Lost Sibling, As You Prepare to Leave, You Say Goodbye to Paimon, You're Adventuring Partner and a Good Friend. But then It Strikes You. Will You Take Paimon along with You Or Leave with You're Sibling?",
    "1bznzas": "TOO SWEET (A Yae Miko x Bullet Club edit)",
    "1bzo6ur": "Nice 3 Year Bug In the mountain quest not fixed still bruh ",
    "1bzo9we": "Help?",
    "1bzoca7": "\"Let the mighty be humbled!\" 💧",
    "1bzoup8": "Experiment EU",
    "1bzp188": "What sword would be best f2p for Kazuha",
    "1bzpdf3": "Thoughts???",
    "1bzpdvw": "Ganyu Illustration~",
    "1bzprm1": "Where do I spend my resin NOW?",
    "1bzq5qk": "I ARRIVED TO AR60 (I don´t remember how, I just noticed while fighting a weekly boss)",
    "1bzqe32": "What just happened? (Noob alert) ",
    "1bzqvl0": "An interesting detail about Furina's eyelashes",
    "1bzr4z9": "Tips for keqing?",
    "1bzrvx0": "What are some good ways to save primogems effectively?",
    "1bzrwfz": "some view",
    "1bzsgsr": "Heads up, you can get welkins for just 50p if you have a samsung device",
    "1bzswbs": "TIL that in low WL/AR, enemies drop 1-star weapons too",
    "1bzt0hh": "If there was something like \"Miss Teyvat\", who would be the representative of each nation? ",
    "1bzt52j": "Mountain creature quest bug",
    "1bzt7cx": "THE GENSHIN COMMUNIY IS SO WHOLESOME",
    "1bztglx": "Xie Ying",
    "1bztiyb": "How’s Lover’s Oath this popular if I’ve never heard of this in game?!",
    "1bztz34": "So, even minor things Traveler does are canon",
    "1bztz66": "Nahida is almost maxed, who should I level next?",
    "1bzu3cq": "Would you guys like it if HYV ever makes 5* versions for some of the current 4* characters, just like Star Rail?",
    "1bzu7lo": "Is Scaramouche really that strong ?",
    "1bzugvr": "Account",
    "1bzuljq": "Ganyu illustration ~ 🪻",
    "1bzultq": "I got all possible achievements in game, ask me something",
    "1bzunnx": "Made a sketch featuring Yoimiya and Ayaka",
    "1bzupo3": "Puzzle",
    "1bzutxc": "My coolest genshin merch find in Japan so far (all contents in pictures)",
    "1bzuwyv": "What's going on in my Mondstadt? Did Inazuma invade them? Why my Mondstadt theme music is Inazuma's?",
    "1bzvebe": "How many of you wish this was true? 🥹💚🪽 ",
    "1bzvjqx": "controller doesn't work on pc, help",
    "1bzvqfy": "Was Paimon always this loud?",
    "1bzvsij": "2024 Birthday Calendar Illustration (CN): Charlotte",
    "1bzvv6w": "Happy birthday Charlotte!",
    "1bzwacs": "Mage Furina_design by me",
    "1bzwpzd": "There's no reason this webgame should be this challenging, but I am all for it!",
    "1bzwvfc": "Which weapon?",
    "1bzwwsp": "What's your most hated gameplay in Genshin Impact ? Mine is the brainstorming, and I can't think of anything more annoying",
    "1bzx258": "I'm thinking about her now. So... How do I take her out? Is my rizz enough?",
    "1bzx8p2": "999 Achievements Complete 💯",
    "1bzxivk": "How good kazuha really is?",
    "1bzxmnb": "Welcome to Fontaine, Traveler✨",
    "1bzxxg9": "Furina pixel art (unfinished) by me",
    "1bzxzth": "When Charlotte said she wanted an Anemo vision, this was what she meant",
    "1bzyc6b": "Decided to download genshin on my new PC",
    "1bzyjyq": "Anybody else finds the hoyofair platformer annoying as hell?",
    "1bzymt2": "This new web event - Lightning Riding Swordsman - is actually quite challenging...",
    "1bzz3n4": "A small rant, i hope it's constructive enough to not get removed. :)",
    "1bzzc8s": "Happy cake day",
    "1bzzolx": "For the first time since playing day 1, I've successfully reached 36* on Spiral Abyss in version 4.5",
    "1bzzxwb": "Out of all of these pictures which one are you most likely to put as your wallpaper? #14",
    "1c00jdz": "My Eula (pyro version)",
    "1c00tjj": "what to do with weapons that are seemingly underpowered",
    "1c00wyu": "Aether helping out Chiori (OC)",
    "1c015p4": "Genshin Impact Characters Posters (OC)",
    "1c01ao1": "“No one can do this job like me”",
    "1c01nbv": "Where am I supposed to pet on this cat?",
    "1c01ntd": "Something happened to the Fatui... [Hi3 crossover]",
    "1c01pcz": "how do you screw up that bad",
    "1c01zbw": "Don't know if I should be happy or sad",
    "1c02lzv": "Is that enough crit or should i farm more 🙂😂",
    "1c030h9": "Build question for hutao",
    "1c03dyu": "As a metroidvania fan, I'm sold - Raiden Hitless Bossfight",
    "1c0491m": "Hoyo pls give me these skins",
    "1c04ahl": "How do I stop regretting my banner choices",
    "1c04ajt": "My mona cosplay~",
    "1c04lsg": "My cat cuddling with Venti plush",
    "1c04y9c": "Will there be 120hz? Iphone 15 pro max have it.",
    "1c0525r": "She so beautiful",
    "1c055zo": "Do you think the furball fortress will still exist after the event ends?",
    "1c05wk9": "How do people achieve 1m+ dmg?",
    "1c06523": "Genshin Endgame Activity",
    "1c06egl": "I got 2 nearly identical artifacts",
    "1c06j6p": "C1 Neuvi or Kazuha",
    "1c075m7": "How to defeat this😭",
    "1c07czw": "HoYoFair 2024 Teaser",
    "1c07fdm": "Smiling cutie✨✨",
    "1c07wih": "Who to pull for?",
    "1c07wvf": "How many C6R1 players are there",
    "1c08fey": "Day 5 of the cat event",
    "1c08q4y": "[Lightning-Riding Swordsman] Secret Ending + Full Fight",
    "1c08z43": "Series drawing slimes from Genshin! Dendro 8/8! All done <3",
    "1c091kq": "Adding just one thing to Dehya's kit",
    "1c093pz": "Predicting future patches in Genshin Impact.",
    "1c093te": "Eula: \"My eyes are up here!\" (Artist: 飛沫かもめ)",
    "1c09cmc": "No Razor, Not Now. Moreover you are not a Cat...",
    "1c0abjg": "Ayaka cosplayer during Eid-ul-fitr prayers this morning ",
    "1c0ajrj": "Another Aranara :]",
    "1c0b5lm": "What in the world am I supposed to do with this? Skimmed all the tutorials and still don't know what to do.",
    "1c0b60t": "Cutscenes don’t make you immortal, but the show MUST go on….",
    "1c0bkq5": "Mobile players",
    "1c0blws": "Aetherrr???!!! where are you looking at???",
    "1c0bn88": "Assign a Pokemon",
    "1c0bqb7": "i did it",
    "1c0bt2o": "Finally! We can pet dogs! :D",
    "1c0bt6q": "Arlecchino fanart",
    "1c0c20a": "Cyno yugioh reference?",
    "1c0c2r1": "What exactly do we know about Egeria the old hydro archon?",
    "1c0c2ut": "They had redeemed themselves for fumbling the possible dog dog interaction",
    "1c0cb7h": "Collei Fanart! I love her!",
    "1c0cel0": "Version 4.6 Special Program Preview",
    "1c0ch3o": "Happy Birthday, Charlotte!",
    "1c0cogu": "my eid accessory",
    "1c0cxlx": "Casual Yae Miko and Raiden Ei",
    "1c0cyj9": "Best and Easiest Recovery dish to farm for?",
    "1c0do80": "Charlotte's Birthday Mail",
    "1c0dtub": "Zaytun peach irl",
    "1c0e378": "Happy birthday to Charlotte!! 🗞️🌟",
    "1c0eem1": "I didn't have the patience to play \"Hollow Knight\" event on Keyboard or Touchscreen, so I used a Controller instead ",
    "1c0etd8": "I'm just here to lift of my sadness. Don't mind me",
    "1c0evao": "cards (not tcg)",
    "1c0fb3q": "Treasure Compass Optimizations and One-Click Crafting With the Serenitea Pot! | Developers Discussion",
    "1c0fddi": "why does the cat keep sneezing?",
    "1c0fdpe": "Treasure compass should also points to puzzles",
    "1c0fi6y": "I miss this event",
    "1c0fkb4": "AMD's AFMF in Genshin Impact?",
    "1c0flx9": "Finally-",
    "1c0fpzg": "Charlotte needs help on her birthday",
    "1c0g4d6": "HoYoFair: Lightning-Riding Swordsman",
    "1c0g6l3": "My Hollow Knight Colosseum of Fools PTSD is coming back",
    "1c0g7t0": "The result",
    "1c0geik": "Do you equip weapons on characters that match their drip over being good for them?",
    "1c0ggtc": "[New Player] Will there ever be an option to replay the limited story events or to at least have an in-game timeline of their story in conjunction with the main questline?",
    "1c0gnct": "Finishing the web event in 6 minutes",
    "1c0gqul": "What about Genshin trailers",
    "1c0gucx": "Alhaitham cosplay ",
    "1c0h1ua": "Daily Questions Megathread (April 10, 2024)",
    "1c0he5q": "For those wondering, yes the furniture you get from this event lets you pet the cats in your teapot permanently ",
    "1c0hers": "hmm, why can't i pet this fur baby?",
    "1c0hpka": "oops... i accidentally hit destroy all and i wasnt paying attention ... XD oh well",
    "1c0hti5": "Head empty, just Husbandos every day :)",
    "1c0hyr3": "After playing for almost 1.5 yrs, finally cleared the abyss",
    "1c0i0bb": "Why did not one told me about the spot earlier",
    "1c0ibuy": "Kunoichi shinobu",
    "1c0iiut": "New Potential Idol Group Spotted! (@henxtie)",
    "1c0in6f": "Just as I was playing the new event, my beloved baby Miko claimed my lap to get some pets too. Double whammy!",
    "1c0j8qb": "Are you ready for Father?",
    "1c0j9fx": "You have to pick 4 characters to protect you while the rest  hunt you down, who are you picking and why?",
    "1c0j9qg": "finally",
    "1c0je9h": "AR 58 cant floor 12 :(",
    "1c0jkse": "Kokomi Chibi",
    "1c0jnt6": "Happy Birthday Charlotte!! 📷📰🧀 (PS5 screenshots)",
    "1c0jscq": "(75% OOT) I'm finished with Helldivers 2 and going back to gacha world",
    "1c0jsuo": "Genshin Impact HoyoFair: Lighting-Riding Swordsman Lyney's First Performance",
    "1c0jvgf": "My gf told me i look like a Lawachurl, should i break up with her?",
    "1c0jxno": "\"Sorry, it's me again...\"",
    "1c0k4bg": "Kaveh cosplayer. Photo by me.",
    "1c0k6kp": "Tips on how to use Interactive map + Resonance Stone to find all Oculi without worrying about missing any of it.",
    "1c0kcw8": "Thoughts?",
    "1c0kit8": "I'm surper happy with Klee!!",
    "1c0kkct": "Using resin to insta finish commissions",
    "1c0kksa": "COLUMBINA GENSHIN IMPACT ",
    "1c0km9o": "I cleared the Fan Game \"Lightning-Riding Swordsman\" in 5:26.77 from Start to defeating Ei.",
    "1c0kyvf": "This team is satisfying... Anyways, any artifact recommendations for Charlotte?",
    "1c0kz9g": "Triple Crowning Charlotte On Her Birthday",
    "1c0l0r5": "The biggest win I've ever had",
    "1c0l40m": "Can we all appreciate how Genshin handled a court trial so beautifully",
    "1c0l55i": "Creazione di Dipendenza (Sorry if my italian is wrong)",
    "1c0l798": "Quick photo of Furina!",
    "1c0ladr": "I made a tierlist based on who would join us for our adventures.",
    "1c0ljc3": "Diona's Hangout bugged?",
    "1c0m41h": "This web event is exactly the kind of difficult content that genshin needs! Now they just have to add the same difficulty to fights in game",
    "1c0mcw6": "fungus",
    "1c0mits": "Can the Suigetsu pool puzzle be bugged?",
    "1c0mki9": "Ganyu fanart",
    "1c0mqtm": "So I was wondering ",
    "1c0mtx9": "Who do I use this for? and no, I don't have nahida nor kazuha",
    "1c0muck": "This really all I can use my Geo Sigils on?",
    "1c0mzbw": "After 6 versions with Fontaine, I can finally complete my first commissions there...",
    "1c0njj2": "I was today years old when I found out that Jean has special \"interaction\" with cats",
    "1c0nkz4": "Is Neuvillette the only character who glows for a long duration even when he is not charge attacking?",
    "1c0no8y": "The last stage of Rolling Crossfire is actually quite fun",
    "1c0nydb": "spring nahida! (oc)",
    "1c0o2n9": "Can’t find Someone’s drifting bottle",
    "1c0oo7s": "Which team comp of my characters do you think works best with Alhaitham as the dps? I'll level characters if I have to, and if it matters, I've got Scara's signature and Amos bow",
    "1c0oons": "Chart of characters elements and weapons from 1.0 to 4.5",
    "1c0p4bd": "2024 Birthday Calendar Illustration (CN): Xianyun",
    "1c0p4oi": "Barbara cosplay!!",
    "1c0p52y": "This website has some of the worst team recommendations. I think everyone should stay away from it and just ask people on Reddit or Discord.",
    "1c0pfwy": "My opinions about the webgame",
    "1c0pjlr": "IQ",
    "1c0pun9": "Happy bday Charlotte",
    "1c0q2hz": "BIRTHDAY MONTH TWINS!! 🤩",
    "1c0q77b": "My Submissions for the Catified Teyvat Fanart Event!",
    "1c0qapn": "Aranara Adventures with Al Haitham, The withering.",
    "1c0qfur": "What are you doing over there Yelan?",
    "1c0qlez": "How do i start quest to touch \"grass\"?",
    "1c0qufp": "Thinking about give her some fan lore",
    "1c0qzzp": "Furina by me",
    "1c0r3bd": "Hu Tao is obviously the GOAT, so I drawed her",
    "1c0rd6h": "Is this endgame?",
    "1c0ret7": "[Hot Take] More Genshin Impact Features Idea from Honkai (and other similar rpgs)",
    "1c0rmw1": "Lighting-Riding Swordsman no upgrade run",
    "1c0rxd2": "Venti Cosplay 🌿",
    "1c0rzx1": "The last puzzle i had to solve for 100% of all Liyue, it also offered a philosophy lesson.",
    "1c0s212": "Beautiful Nahida + Wanderer cosplays filmed at Megacon Birmingham (Photographer)",
    "1c0s8l1": "Careful who you call ugly in court…",
    "1c0t9do": "Best teams to clear floor 12?",
    "1c0te6v": "Are there any characters you share birthdays with?",
    "1c0tkon": "New player team help",
    "1c0tya2": "I drew Yanfei chat sticker!",
    "1c0u9je": "125+ hrs into the game as a new genshin impact player - the quest conflict & co-op design is absurdly clunky & bad. Is this indicative of rest of game where I can’t click on anything random just stick to main quest first?",
    "1c0uy1s": "Out of all of these pictures which one are you most likely to put as your wallpaper? #15",
    "1c0uzzo": "How do you beat the automated supercomputing field generator?",
    "1c0vag1": "If you're missing this Big Boi in your Archive, it's in Abyss right now.",
    "1c0vb34": "PSA. The Restart button doesn't restart the level. Instead wipes all game data and starts game from beginning.",
    "1c0viil": "Hoyo didn't tell us we can pet Razor now",
    "1c0vj72": "After ~3.5 years, finally reached my long-term goal : Everyone is built! Wanted to share it you guys!",
    "1c0vu59": "Fanart of Kaeya that I drew a while ago, hope you like it!",
    "1c0wu1g": "❆Happy birthday Charlotté ❆ my cryo queen ♡♤",
    "1c0wvzl": "Throw back to when my friends Rosaria turned into the flash",
    "1c0xkw4": "Why Scaramouche scares away all the birds (Comic by me)",
    "1c0xyzp": "My cat approves the new event.",
    "1c0ylwp": "Issue with the aranyaka quest",
    "1c0ymvh": "Team suggestions for current abyss? I'm always a star or two short",
    "1c0yqo7": "What happened to sir Pouncealot and Bandit? ;-;",
    "1c0z5bw": "I know this is like searching up if water is wet, but i was searching up which video game was the most expensive to make and...",
    "1c0za7i": "Does 4 peice retracing bolide work on yanfei",
    "1c0zfpm": "If Genshin collabs with HSR, what character would you want from HSR to be added with the collab?",
    "1c0zixg": "I got the Domain door to stay open",
    "1c0zjox": "I drew two of my best teams, can you guess who they are?",
    "1c0zkce": "What do we know of Barbatos strength at his peak?",
    "1c0ztry": "My Raiden Ei cosplay",
    "1c0zuyd": "Genshin player? im more like Teapot player",
    "1c10ryi": "bro chill im not replacing you ",
    "1c1108y": "I finished the story for Genshin Impact and was wondering if Honkai Star Rail and Honkai Impact are any good?",
    "1c11m34": "I drew Charlotte ❤️",
    "1c135wg": "“I wonder if I can change these wonky contro-“",
    "1c13eor": "Finally have a 5 Star weapon for each Archon",
    "1c13s32": "Who’s that one genshin character?",
    "1c1469x": "Neuvillette/Furina/???/Zhongli",
    "1c15kqp": "You are supposed to use the dendrogranum to access these stone pillar seal,but my Guoba completely bypassed it lol,this is like the first time I see Guoba actually being useful in puzzle.",
    "1c15n6z": "Happy Birthday, Xianyun!",
    "1c15qig": "How did you guy deal with the time gaps between your desired banner as a newbie? ",
    "1c15sja": "cant get to this chest pls Help!!",
    "1c15ufp": "I think I got one the most cursed stickers of childe I’ve with my sticker book",
    "1c15ull": "Trusfrated",
    "1c15w52": "A 13 year old girls attempt at drawing Furina!",
    "1c16cqz": "Previously on... Genshin Impact | A Recap of the Prologue and Chapter 1",
    "1c16g9r": "Will Arlecchino be worth it or I might waste potential in boosting my team?",
    "1c16n07": "My cosplay of the nosy auntie Xianyun 🪿✨️ IG: LaQuesadillah",
    "1c183d6": "There we go much better. ",
    "1c18f4x": "started on Klee from Genshin Impact rough sketch",
    "1c18u2m": "Who this would be?",
    "1c18vdm": "Happy Birthday Xianyun!! 🪿🏞️☁️ (PS5 screenshots)",
    "1c194wg": "I tried to pull for Ganyu",
    "1c197wf": "Why does Yelan has a dice on her necklace?"
}